{
  "backend/main.mo": "Empty Motoko actor with no logic.",
  "feature_evidence.json": "Feature evidence report mapping product features to related frontend files and components.",
  "frontend-file-summaries.txt": "List of short descriptions summarizing each frontend source file.",
  "frontend/index.css": "Tailwind setup defining CSS variables for light/dark themes and base styles.",
  "frontend/index.html": "HTML entry point loading fonts and mounting the React app.",
  "frontend/src/App.tsx": "Main React app with tab-based navigation between the five calculator modules.",
  "frontend/src/components/actions/ClearSavedDataButton.tsx": "Button with confirmation dialog that clears all saved localStorage data and reloads the page.",
  "frontend/src/components/branding/AppLogo.tsx": "Logo component displaying the CryptoWise image asset.",
  "frontend/src/components/coins/CoinSearchSelect.tsx": "Searchable CoinGecko-powered coin selector with popover UI.",
  "frontend/src/components/forms/DCAEntryRow.tsx": "Row component for DCA entries with buy price and amount inputs and optional remove button.",
  "frontend/src/components/layout/AppShell.tsx": "App layout with header, background, main content wrapper, and footer.",
  "frontend/src/components/layout/GlassCard.tsx": "Reusable glass-style card wrapper using Tailwind and shadcn card component.",
  "frontend/src/components/share/ShareTradePlanButton.tsx": "Exports a button that captures a referenced DOM element into a canvas and downloads it as an image, showing a loading state during export.",
  "frontend/src/components/share/TradePlanCard.tsx": "Defines a styled card component for displaying trade plan data with a title, coin info, and labeled value rows.",
  "frontend/src/components/visual/RiskRewardIndicator.tsx": "Renders a visual badge and bar indicators showing risk and reward widths based on a risk‑reward ratio.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useCoinGecko.ts": "Provides React Query hooks for searching coins and fetching price and market data from CoinGecko.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for managing authentication state using DFINITY AuthClient.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook syncing state to localStorage with automatic load, save, and reset.",
  "frontend/src/index.css": "Tailwind base setup defining CSS variables and applying global typography and theme styles.",
  "frontend/src/lib/calculators/dca.ts": "Calculates total invested, total tokens, and average entry price for DCA entries.",
  "frontend/src/lib/calculators/futureValue.ts": "Computes future value and total contributions based on initial amount, monthly contributions, and interest rate.",
  "frontend/src/lib/calculators/moonMath.ts": "Computes implied price and multiple by comparing supply and target market cap for two coins.",
  "frontend/src/lib/calculators/pnl.ts": "Calculates token quantity, net profit, and ROI after buy/sell fees for a trade.",
  "frontend/src/lib/calculators/risk.ts": "Computes position size, risk metrics, and optional risk‑reward ratio based on entry, stop, capital, and targets.",
  "frontend/src/lib/format.ts": "Utility functions for formatting numbers as USD, percentages, tokens, and general numeric formats.",
  "frontend/src/lib/storageKeys.ts": "Defines localStorage keys for calculator states and provides a helper to clear them all.",
  "frontend/src/lib/utils.ts": "Exports a utility to merge Tailwind and class names using clsx and twMerge.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/modules/DCAModule.tsx": "Provides an interactive DCA calculator with dynamic entry rows, local storage state, computed totals, and shareable plan output.",
  "frontend/src/pages/modules/FutureValueModule.tsx": "Implements a compound‑interest future value calculator with user inputs, persisted state, computed projections, and shareable output.",
  "frontend/src/pages/modules/MoonMathModule.tsx": "Fetches market data for two coins and calculates implied price targets based on relative market caps, with selection UI and validation.",
  "frontend/src/pages/modules/PnLModule.tsx": "Calculates profit/loss with fees, optional live price integration, coin selection, and summarizes trade metrics.",
  "frontend/src/pages/modules/RiskModule.tsx": "Computes position sizing and risk metrics from entry, stop loss, and capital inputs, with validation and optional target price.",
  "frontend/src/services/coingecko.ts": "Wraps CoinGecko API calls for searching coins, fetching prices, and retrieving market data with basic error handling.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom colors, fonts, layouts, and animations with added plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing the CryptoWise Strategy Hub, its architecture plans, required images, and current feature list with versions."
}