{
  "backend/main.mo": "Motoko actor providing financial calculation functions including future value with compound interest, inflation, and tax adjustments, plus text validation utilities for alphanumeric input, email, and positive numbers.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: investigating/resolving 'Failed to fetch' errors in CoinGecko API integration, and adding error boundaries with improved error handling for network failures.",
  "frontend-file-summaries.txt": "Comprehensive summaries of frontend components including calculator modules (P&L, Risk, DCA, Moon Math, Future Value), error handling components, CoinGecko API integration, formatting utilities, and responsive layout components with mobile-first design.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI elements including background, foreground, primary, secondary, muted, accent, destructive, borders, and chart colors.",
  "frontend/index.html": "HTML entry point with SEO metadata, Open Graph tags, Twitter Card configuration, Google Fonts preconnect, and service worker registration for offline support.",
  "frontend/src/App.tsx": "Main application component with ErrorBoundary wrapper, tabbed navigation for six calculator modules (P&L, Risk, DCA, Moon Math, Future Value, Decision), and responsive tab layout.",
  "frontend/src/components/actions/ClearSavedDataButton.tsx": "Button component with confirmation dialog that clears all localStorage data using clearAllStorageKeys utility and reloads the page.",
  "frontend/src/components/branding/AppLogo.tsx": "Responsive logo component rendering CryptoWise branding image with picture element for optimized delivery and size variants for mobile and desktop.",
  "frontend/src/components/coins/CoinSearchSelect.tsx": "A searchable dropdown component for selecting cryptocurrency coins, integrating with CoinGecko API and displaying coin thumbnails, names, and symbols with loading and error states.",
  "frontend/src/components/feedback/ApiErrorDisplay.tsx": "A reusable error alert component that displays API error messages with an optional retry button.",
  "frontend/src/components/feedback/ErrorBoundary.tsx": "A React error boundary class component that catches and displays unhandled errors with options to retry or reload the page.",
  "frontend/src/components/feedback/OfflineIndicator.tsx": "A fixed-position alert banner that appears when the user loses internet connection, using the useOnlineStatus hook.",
  "frontend/src/components/forms/DCAEntryRow.tsx": "A form row component for entering DCA (Dollar Cost Averaging) trade entries with buy price and amount inputs, plus a remove button.",
  "frontend/src/components/layout/AppShell.tsx": "The main application layout wrapper providing header with logo, footer with attribution, background styling, and offline indicator integration.",
  "frontend/src/components/layout/GlassCard.tsx": "A styled Card wrapper component that applies glassmorphism effects with backdrop blur and semi-transparent background.",
  "frontend/src/components/share/ShareTradePlanButton.tsx": "A button component that exports a trade plan card as a PNG image using canvas rendering, with loading state during export.",
  "frontend/src/components/share/TradePlanCard.tsx": "A forwardRef card component that displays formatted trade plan data with coin information, designed for export/sharing functionality.",
  "frontend/src/components/visual/RiskRewardIndicator.tsx": "A visual component that displays risk-to-reward ratio using colored badges and horizontal bar charts with quality assessment.",
  "frontend/src/hooks/useActor.ts": "A React Query hook that manages Internet Identity authentication and creates backend actors, invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useCoinGecko.ts": "Custom React Query hooks for fetching coin search results, current prices, and market data from CoinGecko API with rate limit handling and retry logic.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useLocalStorageState.ts": "React hook that syncs state with localStorage, providing get/set/reset functionality with JSON serialization and error handling.",
  "frontend/src/hooks/useOnlineStatus.ts": "React hook that tracks browser online/offline status using navigator.onLine and window events.",
  "frontend/src/hooks/usePageMeta.ts": "React hook that dynamically updates document title and meta tags (description, Open Graph) based on provided page metadata.",
  "frontend/src/index.css": "Global Tailwind CSS configuration with custom CSS variables for theming (colors, spacing, fonts) and responsive design adjustments for mobile devices.",
  "frontend/src/lib/calculators/dca.ts": "Calculator for Dollar Cost Averaging that computes total invested, total tokens acquired, and average entry price from multiple buy entries.",
  "frontend/src/lib/calculators/decision.ts": "Investment decision calculator that evaluates multiple criteria (ROI, risk, price targets, market cap, price changes) and returns a Buy/Sell/Hold/Wait recommendation with scoring.",
  "frontend/src/lib/calculators/futureValue.ts": "Calculates future value of investments with initial amount, monthly contributions, and compound interest over a specified time period.",
  "frontend/src/lib/calculators/moonMath.ts": "Calculates implied price and price multiple for a coin if it reached another coin's market cap, given current price and supply.",
  "frontend/src/lib/calculators/pnl.ts": "Profit and Loss calculator that computes token quantity, net profit, and ROI from investment amount, buy/sell prices, and trading fees.",
  "frontend/src/lib/calculators/risk.ts": "Position sizing calculator that determines safe position size based on entry price, stop-loss, total capital, risk percentage, and optional target price for risk-reward ratio.",
  "frontend/src/lib/format.ts": "Utility functions for formatting numbers, currency, percentages, and tokens with abbreviations (M/B/T) for large values and locale-aware decimal formatting.",
  "frontend/src/lib/seo.ts": "Defines SEO metadata configuration for each calculator module (P&L, Risk, DCA, Moon Math, Future Value, Decision) including titles, descriptions, and Open Graph tags.",
  "frontend/src/lib/storageKeys.ts": "Exports versioned localStorage keys for persisting calculator state and provides a utility function to clear all stored data.",
  "frontend/src/lib/utils.ts": "Utility function that merges Tailwind CSS classes using clsx and tailwind-merge for conditional styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query, Internet Identity provider, and renders the root App component.",
  "frontend/src/pages/modules/DCAModule.tsx": "Dollar-cost averaging calculator module that manages multiple buy entries, calculates average entry price and total tokens, and supports sharing trade plans.",
  "frontend/src/pages/modules/DecisionModule.tsx": "Trading decision engine that evaluates configurable criteria (ROI, risk, price targets, market cap, price changes) against live coin data to provide buy/sell/hold recommendations.",
  "frontend/src/pages/modules/FutureValueModule.tsx": "Future value calculator that projects long-term investment growth using backend canister calculations with compound interest, monthly contributions, inflation, and tax considerations.",
  "frontend/src/pages/modules/MoonMathModule.tsx": "Market cap comparison tool that calculates implied price if one coin reaches another coin's market cap, using live CoinGecko data for price and supply information.",
  "frontend/src/pages/modules/PnLModule.tsx": "React component for profit/loss calculation with coin selection, live price fetching from CoinGecko, trading fee inputs, and shareable trade plan cards with offline status handling.",
  "frontend/src/pages/modules/RiskModule.tsx": "React component for risk management and position sizing calculations based on entry price, stop-loss, capital, and risk percentage with visual risk/reward indicators and shareable trade plans.",
  "frontend/src/service-worker.ts": "Service worker implementing cache-first strategy for offline support, caching core assets and skipping external API requests like CoinGecko.",
  "frontend/src/services/coingecko.ts": "CoinGecko API service with timeout handling, custom error types (NetworkError, RateLimitError), and functions for searching coins, fetching prices, and retrieving market data.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, responsive breakpoints, safe area spacing, glass morphism effects, and animation utilities.",
  "frontend/vite.config.ts": "Vite configuration with React plugin, path aliases, API proxy to local dfx server, manual chunk splitting for vendors, and environment variable injection for canister IDs.",
  "project_state.json": "Project state tracking document indicating investigation of 'Failed to fetch' errors with existing features for error handling improvements and pending verification of backend actor connections."
}